bench/BENCH-1-TEST-SIMPLE.txt
Running 2s warmup @ http://localhost:3000
1 connections
10 workers

Running 30s test @ http://localhost:3000
500 connections
10 workers

/
┌─────────┬──────┬───────┬────────┬──────────┬───────────┬────────────┬──────────┐
│ Stat    │ 2.5% │ 50%   │ 97.5%  │ 99%      │ Avg       │ Stdev      │ Max      │       
├─────────┼──────┼───────┼────────┼──────────┼───────────┼────────────┼──────────┤       
│ Latency │ 8 ms │ 47 ms │ 563 ms │ 10208 ms │ 282.13 ms │ 1842.83 ms │ 30092 ms │       
└─────────┴──────┴───────┴────────┴──────────┴───────────┴────────────┴──────────┘       
┌───────────┬────────┬────────┬────────┬─────────┬────────┬─────────┬────────┐
│ Stat      │ 1%     │ 2.5%   │ 50%    │ 97.5%   │ Avg    │ Stdev   │ Min    │
├───────────┼────────┼────────┼────────┼─────────┼────────┼─────────┼────────┤
│ Req/Sec   │ 2749   │ 2749   │ 4563   │ 8439    │ 4567.5 │ 1053.81 │ 2749   │
├───────────┼────────┼────────┼────────┼─────────┼────────┼─────────┼────────┤
│ Bytes/Sec │ 418 kB │ 418 kB │ 694 kB │ 1.28 MB │ 694 kB │ 160 kB  │ 418 kB │
└───────────┴────────┴────────┴────────┴─────────┴────────┴─────────┴────────┘
┌──────┬────────┐
│ Code │ Count  │
├──────┼────────┤
│ 200  │ 137002 │
└──────┴────────┘

Req/Bytes counts sampled once per second.
# of samples: 300

┌────────────┬──────────────┐
│ Percentile │ Latency (ms) │
├────────────┼──────────────┤
│ 0.001      │ 0            │
├────────────┼──────────────┤
│ 0.01       │ 0            │
├────────────┼──────────────┤
│ 0.1        │ 0            │
├────────────┼──────────────┤
│ 1          │ 5            │
├────────────┼──────────────┤
│ 2.5        │ 8            │
├────────────┼──────────────┤
│ 10         │ 19           │
├────────────┼──────────────┤
│ 25         │ 30           │
├────────────┼──────────────┤
│ 50         │ 47           │
├────────────┼──────────────┤
│ 75         │ 65           │
├────────────┼──────────────┤
│ 90         │ 90           │
├────────────┼──────────────┤
│ 97.5       │ 563          │
├────────────┼──────────────┤
│ 99         │ 10208        │
├────────────┼──────────────┤
│ 99.9       │ 19921        │
├────────────┼──────────────┤
│ 99.99      │ 29890        │
├────────────┼──────────────┤
│ 99.999     │ 30076        │
└────────────┴──────────────┘

241k requests in 30.18s, 20.8 MB read
104k errors (315 timeouts)
Done in 51.28s.