bench/BENCH-2-TEST-CLUSTER-12-WORKERS copy.txt
$ autocannon -c 500 -d 30 --workers 10 --renderStatusCodes --latency --warmup [ -c 1 -d 2 ] localhost:3000
Running 2s warmup @ http://localhost:3000
1 connections
10 workers

Running 30s test @ http://localhost:3000
500 connections
10 workers

/
┌─────────┬──────┬───────┬────────┬────────┬──────────┬─────────┬─────────┐
│ Stat    │ 2.5% │ 50%   │ 97.5%  │ 99%    │ Avg      │ Stdev   │ Max     │
├─────────┼──────┼───────┼────────┼────────┼──────────┼─────────┼─────────┤
│ Latency │ 0 ms │ 12 ms │ 204 ms │ 359 ms │ 33.87 ms │ 69.6 ms │ 1992 ms │
└─────────┴──────┴───────┴────────┴────────┴──────────┴─────────┴─────────┘
┌───────────┬─────────┬─────────┬─────────┬─────────┬──────────┬─────────┬─────────┐     
│ Stat      │ 1%      │ 2.5%    │ 50%     │ 97.5%   │ Avg      │ Stdev   │ Min     │     
├───────────┼─────────┼─────────┼─────────┼─────────┼──────────┼─────────┼─────────┤     
│ Req/Sec   │ 12215   │ 12215   │ 24079   │ 30479   │ 23619.86 │ 3974.62 │ 12210   │     
├───────────┼─────────┼─────────┼─────────┼─────────┼──────────┼─────────┼─────────┤     
│ Bytes/Sec │ 1.86 MB │ 1.86 MB │ 3.67 MB │ 4.65 MB │ 3.6 MB   │ 606 kB  │ 1.86 MB │     
└───────────┴─────────┴─────────┴─────────┴─────────┴──────────┴─────────┴─────────┘     
┌──────┬────────┐
│ Code │ Count  │
├──────┼────────┤
│ 200  │ 697831 │
└──────┴────────┘

Req/Bytes counts sampled once per second.
# of samples: 289

┌────────────┬──────────────┐
│ Percentile │ Latency (ms) │
├────────────┼──────────────┤
│ 0.001      │ 0            │
├────────────┼──────────────┤
│ 0.01       │ 0            │
├────────────┼──────────────┤
│ 0.1        │ 0            │
├────────────┼──────────────┤
│ 1          │ 0            │
├────────────┼──────────────┤
│ 2.5        │ 0            │
├────────────┼──────────────┤
│ 10         │ 2            │
├────────────┼──────────────┤
│ 25         │ 5            │
├────────────┼──────────────┤
│ 50         │ 12           │
├────────────┼──────────────┤
│ 75         │ 40           │
├────────────┼──────────────┤
│ 90         │ 73           │
├────────────┼──────────────┤
│ 97.5       │ 204          │
├────────────┼──────────────┤
│ 99         │ 359          │
├────────────┼──────────────┤
│ 99.9       │ 739          │
├────────────┼──────────────┤
│ 99.99      │ 1300         │
├────────────┼──────────────┤
│ 99.999     │ 1768         │
└────────────┴──────────────┘

699k requests in 30.43s, 106 MB read
290 errors (0 timeouts)
Done in 36.80s.