bench/BENCH-3-TEST-CLUSTER-6-WORKERS.txt
$ autocannon -c 500 -d 30 --workers 10 --renderStatusCodes --latency --warmup [ -c 1 -d 2 ] localhost:3000
Running 2s warmup @ http://localhost:3000
1 connections
10 workers

Running 30s test @ http://localhost:3000
500 connections
10 workers

|
┌─────────┬──────┬───────┬───────┬────────┬──────────┬──────────┬─────────┐
│ Stat    │ 2.5% │ 50%   │ 97.5% │ 99%    │ Avg      │ Stdev    │ Max     │
├─────────┼──────┼───────┼───────┼────────┼──────────┼──────────┼─────────┤
│ Latency │ 3 ms │ 15 ms │ 81 ms │ 101 ms │ 21.41 ms │ 24.59 ms │ 1013 ms │
└─────────┴──────┴───────┴───────┴────────┴──────────┴──────────┴─────────┘
┌───────────┬─────────┬─────────┬─────────┬────────┬──────────┬─────────┬─────────┐      
│ Stat      │ 1%      │ 2.5%    │ 50%     │ 97.5%  │ Avg      │ Stdev   │ Min     │      
├───────────┼─────────┼─────────┼─────────┼────────┼──────────┼─────────┼─────────┤      
│ Req/Sec   │ 14751   │ 14751   │ 23263   │ 41535  │ 22848.94 │ 4158.72 │ 14745   │      
├───────────┼─────────┼─────────┼─────────┼────────┼──────────┼─────────┼─────────┤      
│ Bytes/Sec │ 2.24 MB │ 2.24 MB │ 3.53 MB │ 6.3 MB │ 3.47 MB  │ 631 kB  │ 2.24 MB │      
└───────────┴─────────┴─────────┴─────────┴────────┴──────────┴─────────┴─────────┘      
┌──────┬────────┐
│ Code │ Count  │
├──────┼────────┤
│ 200  │ 685455 │
└──────┴────────┘

Req/Bytes counts sampled once per second.
# of samples: 300

┌────────────┬──────────────┐
│ Percentile │ Latency (ms) │
├────────────┼──────────────┤
│ 0.001      │ 0            │
├────────────┼──────────────┤
│ 0.01       │ 0            │
├────────────┼──────────────┤
│ 0.1        │ 0            │
├────────────┼──────────────┤
│ 1          │ 2            │
├────────────┼──────────────┤
│ 2.5        │ 3            │
├────────────┼──────────────┤
│ 10         │ 5            │
├────────────┼──────────────┤
│ 25         │ 9            │
├────────────┼──────────────┤
│ 50         │ 15           │
├────────────┼──────────────┤
│ 75         │ 24           │
├────────────┼──────────────┤
│ 90         │ 44           │
├────────────┼──────────────┤
│ 97.5       │ 81           │
├────────────┼──────────────┤
│ 99         │ 101          │
├────────────┼──────────────┤
│ 99.9       │ 233          │
├────────────┼──────────────┤
│ 99.99      │ 758          │
├────────────┼──────────────┤
│ 99.999     │ 994          │
└────────────┴──────────────┘

686k requests in 30.11s, 104 MB read
Done in 36.47s.